test/testdata/rr.rr456.v1/rr456.paring.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iden="http://x-road.eu/xsd/identifiers"
                   xmlns:prod="http://rr.x-road.eu/producer/rr" xmlns:xro="http://x-road.eu/xsd/xroad.xsd">
    <SOAP-ENV:Header>
        <xro:userId>EE11111111111</xro:userId>
        <xro:id>nkvw9k2AVvrukYlVAGXRYg</xro:id>
        <xro:protocolVersion>4.0</xro:protocolVersion>
        <xro:client iden:objectType="SUBSYSTEM">
            <iden:xRoadInstance>ee-test</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>70009999</iden:memberCode>
            <iden:subsystemCode>mocksystem</iden:subsystemCode>
        </xro:client>
        <xro:service iden:objectType="SERVICE">
            <iden:xRoadInstance>ee-test</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>70008899</iden:memberCode>
            <iden:subsystemCode>rr</iden:subsystemCode>
            <iden:serviceCode>RR456</iden:serviceCode>
            <iden:serviceVersion>v1</iden:serviceVersion>
        </xro:service>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <prod:RR456
                xmlns:prod="http://rr.x-road.eu/producer/rr">
            <request>
                <Isikukood>38211020380</Isikukood>
            </request>
        </prod:RR456>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
